Autodesk.Revit.DB.ExportIFCCategoryInfo.IsDefault
Determines if a ExportIFCCategoryInfo contains default information.
Remarks:
We consider an ExportIFCCategoryInfo is set to default if it is
set to export and has no entity name.
Returns:
True if the ExportIFCCategoryInfo contains only default information.
Since:
2025

Autodesk.Revit.DB.ExportIFCCategoryInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportIFCCategoryInfo.IFCPresentationLayerName
The name of the presentation layer mapped to a particular Revit category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.ExportIFCCategoryInfo.IFCUserDefinedType
The name of the user-defined type mapped to a particular Revit category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.ExportIFCCategoryInfo.IFCPredefinedType
The name of the predefined type mapped to a particular Revit category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.ExportIFCCategoryInfo.IFCEntityName
The name of the IFC entity mapped to a particular Revit category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.ExportIFCCategoryInfo.IFCExportFlag
The boolean value that indicates whether the category is exported to ifc.
Since:
2025

Autodesk.Revit.DB.ExportIFCCategoryInfo.#ctor(System.Boolean,System.String,System.String,System.String,System.String)
Constructs a new ExportIFCCategoryInfo with input values.
ifcExportFlag:
The flag that indicates whether the category is exported.
ifcEntityName:
The IFC entity name.
ifcPredefinedType:
The IFC predefined type.
ifcUserDefinedType:
The IFC user defined type.
ifcPresentationLayerName:
The IFC presentation layer name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.ExportIFCCategoryInfo.#ctor
Constructs a new ExportIFCCategoryInfo with default values.
Since:
2025

Autodesk.Revit.DB.ExportIFCCategoryInfo
Represents the mapped IFC information stored in the template.
Since:
2025